Repository: MarkusHackspacher/pyLottoSimu
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: de

source: Contributing to pyLottoSimu
de: Beitragen zur pyLottoSimu

source: Contents
de: Inhalt

source: You are very welcome to contribute to the project! The bugtracker and git repository can be found at the `project's page <https://github.com/MarkusHackspacher/pyLottoSimu/>`_. If you have an idea, tell it at https://gitter.im/MarkusHackspacher/pyLottoSimu . Thank you in advance.
de: Sie sind herzlich eingeladen, zu dem Projekt beitragen! Im Bugtracker und Git Repository finden Sie unter der `Projekt Seite <https://github.com/MarkusHackspacher/pyLottoSimu/>` _. Wenn Sie eine Idee haben, sagen Sie es auf https://gitter.im/MarkusHackspacher/pyLottoSimu. Vielen Dank im Voraus.

source: How to contribute
de: Wie trage ich dazu bei

source: There are various possibilities to get involved, for example you can:
de: Es gibt verschiedene Möglichkeiten, sich zu engagieren, zum Beispiel können Sie:

source: `Report bugs <https://github.com/MarkusHackspacher/pyLottoSimu/issues/new>`_ preferably with patches if you can;
de: `Melde Fehler <https://github.com/MarkusHackspacher/pyLottoSimu/issues/new>`_ vorzugsweise mit Patches, wenn du kannst;

source: Enhance this `documentation <https://github.com/MarkusHackspacher/pyLottoSimu/tree/master/docs>`_
de: Verbessern das `Dokumentation <https://github.com/MarkusHackspacher/pyLottoSimu/tree/master/docs>` _

source: `Fork the code <https://github.com/MarkusHackspacher/pyLottoSimu>`_, implement new features, test and send a pull request
de: `Fork den Code <https://github.com/MarkusHackspacher/pyLottoSimu>`_, implementiere neue Funktionen, teste und sende eine Pull-Anfrage

source: Running the test suite
de: Testsuite wird ausgeführt

source: To run the tests, just type the following on a terminal::
de: Um die Tests auszuführen, tippen Sie einfach folgendes auf einem Terminal::
