Repository: MarkusHackspacher/pyLottoSimu
Catalog: docs/locale/*/LC_MESSAGES/history.po
Languages: de, it

source: History
de: Historie
it: Storico

source: Contents
de: Inhalt
it: Contenuti

source: Version
it: Versione

source: The current version is 1.8 from Mai 21, 2018.
de: Die aktuelle Version ist 1.8 vom 21. Mai 2018.
it: La versione attuale è di 1.8 da Mai 21, 2018.

source: Preview next version
de: Vorschau nächste Version
it: Anteprima della prossima versione

source: The program starts with the last selected lotto system.
de: Das Programm beginnt mit dem letzten ausgewählten Lotto-System.
it: Il programma inizia con l'ultimo sistema di lotto selezionato.

source: Support only Python 3 and Qt5.
de: Unterstützt nur Python 3 und Qt5.
it: Supporto solo Python 3 e Qt5.

source: planned release first quarter 2019.
de: geplanten Release im ersten Quartal 2019.
it: versione prevista per il primo trimestre 2019.

source: Version 1.7
it: Versione 1.7

source: release at June 17, 2018, more code tests integrate.
de: Veröffentlichung am 17 Juni 2018, mehr Code-Tests integrieren.
it: rilascio a giugno 17, 2018, più test di codice si integrano.

source: Version 1.6.1
it: Versione 1.6.1

source: Version 1.6.1 from September 2, 2015.
de: Version 1.6.1 vom 2. September 2015.
it: Versione 1.6.1 dal 2 settembre 2015.

source: Version 1.6
it: Versione 1.6

source: The version 1.6 from June 3, 2015 could be choose between four lottery systems, the German 6 out of 49 is default, the Austrian 6 out of 45 with a bonus number, the Euro 5 million from 50 with two Super numbers 1-11 and as well as the American Powerball Lottery 5 of 59 and a Bonus number in the range 1 to 35th Under the hood, the program logic of the surface is no longer dependent and it will in the next version also use the program without a graphical Enter surface. So the program structure is clearly arranged and it may be better to reuse parts of the program in other programs. Furthermore can be with Python tools create an .exe file::
de: Bei der Version 1.6 vom 3. Juni 2015 ist es möglich zwischen vier Lottosysteme zu wählen, das deutsche Lotto 6 aus 49 ist default, das Österreichische 6 aus 45 mit einer Zusatzzahl, die EuroMillionen 5 aus 50 mit zwei Superzahlen zwischen 1 und 11 und sowie die Amerikanische Powerball Lottery 5 aus 59 und eine Zusatzzahl im Bereich 1 bis 35. Unter der Haube ist die Programmlogik von der Oberfläche unabhängiger und es wird in der nächsten Version auch das Programm ohne eine grafische Oberfläche geben. So wird die Programmstruktur übersichtlicher und es lassen sich besser Programmteile in anderen Programmen wiederverwenden. Desweiteren lässt sich mit Pythontools eine .exe Datei erstellen::
it: La versione 1.6 dal 3 giugno 2015 potrebbe essere scegliere tra quattro sistemi di lotterie, tedesco 6 su 49 è predefinito, l'austriaco 6 su 45 con un numero di bonus, l'Euro 5 milioni da 50 con due Super numeri 1-11 e così come l'americano Powerball Lottery 5 di 59 e un numero di Bonus nel range da 1 a 35 ° sotto il cofano, la logica di programma della superficie non è più dipendente e sarà nella prossima versione inoltre utilizzare il programma senza una superficie grafica di invio. Così la struttura del programma è chiaramente organizzata e potrebbe essere meglio di riutilizzare parti del programma in altri programmi. Inoltre può essere con Python strumenti crea un file .exe::

source: If anyone would like to offer this program as a gimmick on his website, thereby adjusts the link to the homepage it can do like to feel free.
de: Wenn jemand diese Programm als Gimmick auf seiner Homepage anbieten möchte, dabei den Link zur Homepage anpasst kann es gern tun.
it: Se qualcuno desidera offrire questo programma come un'arma sul suo sito web, quindi modifica il link alla homepage che può fare per sentirsi gratuito.

source: Version 1.5
it: Versione 1.5

source: The Version 1.5 from February 20, 2014, can be start with Qt4 or QT5.
de: Die Version 1.5 vom 20. Februar 2014, lässt sich mit Qt4 oder mit Qt5 starten.
it: La versione 1.5 del 20 febbraio 2014 può iniziare con Qt4 o QT5.

source: Version 1.4
it: Versione 1.4

source: The renewals in Version 1.4 of October 3, 2013 from pyLottoSimu is multilingualism there are now nine languages. And in Program window there is a major change, it can now Select whether the number overview window to appear automatically after the draw.
de: Die Erneuerungen in der Version 1.4 von 3.Oktober 2013 vom pyLottoSimu ist die Mehrsprachigkeit mittlerweile sind es neun Sprachen. Und im Programmfenster gibt es auch einen größere Änderung, es lässt sich jetzt Auswählen ob das Zahlenübersichtsfenster automatisch nach der Ziehung angezeigt werden soll.
it: I rinnovi nella versione 1.4 di ottobre 3, 2013 di pyLottoSimu sono plurilinguistici ora sono nove lingue. Nella finestra del programma c'è un cambiamento importante, ora può scegliere se la finestra di panoramica del numero apparirà automaticamente dopo il disegno.
