Repository: MarkusHackspacher/pyLottoSimu
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: it

source: Welcome to pyLottoSimu's documentation!
it: Benvenuti nella documentazione di pyLottoSimu!

source: Lotto Generator and Simulator
it: Lotto Generatore e Simulatore

source: a simulation of Lotto Germany (pick 6 out of 49), Lotto Austria (pick 6 out of 45), EuroMillionen, Powerball Lottery US, Mega Millions lottery and Hot Lotto Sizzler system.
it: una simulazione del Lotto Germania (scegliere 6 su 49), Lotto Austria (scegliere 6 su 45), EuroMillionen, Powerball Lotteria Stati Uniti, Mega Millions lotteria e Hot Lotto Sizzler sistema.

source: The pyLottoSimu program generates random lottery numbers and can simulate a draw. In the simulation view a Lotto Ball is visible on the numbers rotate faster and faster, and is finally available, this is the text, the first number of today\'s draw was the ... Maybe it was indeed actually the numbers of the next draw, of course are here, all the figures provided without guarantee.
it: Il programma pyLottoSimu genera numeri casuali della lotteria e può simulare un pareggio. Nella vista di simulazione un Lotto Ball è visibile sui numeri ruotano più velocemente e più velocemente, ed è finalmente disponibile, questo è il testo, il primo numero del sorteggio di oggi è stato il . Forse sono stati effettivamente i numeri del prossimo pareggio, naturalmente, sono qui, tutte le cifre fornite senza garanzia.

source: pyLottoSimu can be started in these languages:
it: pyLottoSimu può essere iniziato in queste lingue:

source: English, German, French, Spanish, Italian, Danish, Dutch, Polish and Russian
it: Inglese, tedesco, francese, spagnolo, italiano, danese, olandese, polacco e russo

source: Start
it: Inizio

source: The program requires Python_ 3.x and `Qt5 for Python`_.
it: Il programma richiede Python_ 3.x e `Qt5 per Python`_.

source: Start with::
it: Comincia con::

source: Documentation
it: Documentazione

source: Make the documentation as .html file::
it: Crea la documentazione come file .html::

source: Add new modules with::
it: Aggiungi nuovi moduli con::

source: Contents:
it: Contenuti:

source: Indices and tables
it: Indici e tabelle
