Repository: MarkusHackspacher/pyLottoSimu
Catalog: docs/locale/*/LC_MESSAGES/install.po
Languages: de

source: Installing pyLottoSimu should usually be quite easy, as you can simply unpack and run pyLottoSimu in place if you wish to do so.
de: pyLottoSimu zu starten ist echt einfach, in ein Verzeichniss nach Wunsch den Quelltext entpacken und starten

source: Contents
de: Inhalt

source: dependencies
de: Abhängigkeiten

source: You'll need these dependencies to run the program:
de: Diese Abhängigkeiten zum Ausführen des Programms benötigen Sie Folgendes:

source: `python <http://www.python.org>`_ - The python programming language along with python-setuptools
de: "Python <http://www.python.org>' _ - Python Programmiersprache zusammen mit Python-Setuptools

source: `pyQt5 <http://www.riverbankcomputing.com/software/pyqt/download5>`_ - Qt5 for Python
de: `pyQt5 <http://www.riverbankcomputing.com/software/pyqt/download5>`_ - Qt5 für Python

source: build the help
de: Hilfe generieren

source: `Sphinx <http://sphinx-doc.org/>`_ - Documentation
de: `Sphinx <http://sphinx-doc.org/>`_ - Dokumentation

source: code test
de: Codestyle Test

source: isort - import sorting and checking tool
de: isort - import Sortier- und Prüfwerkzeug

source: nose - start nosetests to run the tests
de: nose - um die Tests durchzuführen

source: version control system Git
de: Versionsverwaltung Git

source: `Git <https://git-scm.com/>`_ - Git - distributed version control system
de: `Git <https://git-scm.com/>`_ - Git - Versionskontrollsystem

source: Installing Debian or Ubuntu
de: Installation bei Debian oder Ubuntu

source: First you need to your computer these programs: Python, pyQt5 and version control system git::
de: Zuerst brauchst du auf deinen Rechner diese Programme: Python und pyQt5 und optimal die Versionsverwaltung Git.

source: Then you copied the source code of the program on your computer, either download the zip file of the project or download with the version control system::
de: Dann kopiert du den Quellcode des Programmes auf deinem Rechner, entweder das zip File von den Projekt herunterladen oder eleganter mit der Versionsverwaltung Git herunterladen::

source: change the directory and run::
de: In das Verzeichniss wechseln und starten
