Repository: MarkusHackspacher/pyLottoSimu
Catalog: docs/locale/*/LC_MESSAGES/tests.po
Languages: de

source: tests package
de: Test

source: Submodules
de: Untermodule

source: tests.test_drawlotto module
de: tests.test_drawlotto Modul

source: Test the lotto draw with some input numbers
de: Teste die Lottoziehung mit einigen eingegebenen Zahlen

source: Init class pylotto.drawlotto
de: Initiiere class pylotto.drawlotto

source: Returns
de: Zurück

source: none
de: keine

source: test draw without a additional number
de: Testziehung ohne zusätzliche Nummer

source: test draw with a additional number
de: Testziehung mit einer zusätzlichen Nummer

source: test draw with a separate additional number
de: Testziehung mit weiterer zusätzlicher Nummer

source: test draw one number without a additional number
de: Testziehung mit einer Zahl und ohne zusätzlicher Zahl

source: test draw three number without a additional number
de: Testziehung mit 3 Zahlen ohne zusätzlicher Zahl

source: test draw two number without a additional number
de: Testziehung mit einer Zahl und ohne Zusatzzahl

source: test set draw to no number and make sure to set to one number
de: Dieser Test ziehen keine Nummer und stellt sicher, dass eine Zahl gesetzt wird

source: Test lotto.data
de: lotto.data testen

source: tests.test_lottosettingdialog module
de: tests.test_lottosettingdialog Modul

source: Test the dialog module
de: Dialogmodul testen

source: Test of drawing
de: Ziehung testen

source: Creates the QApplication instance
de: Erstellt die QApplication Instanz

source: Test the code format of the file
de: Codeformat der Datei testen

source: read the lottosystems.json file
de: lese lottosystems.json

source: test with one ball numbers
de: mit einer Ballnummer testen

source: test separate bonus numbers
de: separate Bonus-Nummern testen

source: test the same ball numbers and bonus numbers in a maximal draw of 5 numbers
de: Testet auf die gleichen Ballnummern und Bonus-Nummern in einer maximalen Ziehung von 5 Zahlen

source: test with two ball numbers
de: mit zwei Ballnummern testen

source: Module contents
de: Modulinhalte
