Repository: MarkusHackspacher/pyLottoSimu
Catalog: docs/locale/*/LC_MESSAGES/translate.po
Languages: de

source: Translate
de: Übersetze

source: Contents
de: Inhalt

source: GUI Translate
de: Benutzeroberfläche übersetzen

source: To translate the program or make a translation in your language, insert in the complete.pro your language code. ::
de: Um das Programm zu Übersetzen oder eine Übersetzung in Ihrer Sprache hinzuzufügen, legen Sie in der complete.pro eine Zeile mit ihren Sprachcode an. ::

source: translate your language file: lotto1_xx.ts, and produce the .ts translation files with::
de: Ihre Sprachdatei übersetzen: lotto1_xx.ts und die Erstellung der .ts Übersetzungdateien mit::

source: Documentation Translate
de: Dokumentation zu übersetzen

source: this documentation is in English and translated in German, generated by Sphinx_.::
de: Diese Dokumentation ist auf Deutsch und Englisch, generiert durch Sphinx_.::

source: Extract document’s translatable messages into pot files. As a result, many pot files are generated under _build/locale. With *sphinx-intl* command update the docs/locale/de directory::
de: Die vorkommenden Textstellen werden in pot Dateien kopiert. Mit dem Befehl werden viele pot Dateien unter _build/locale generiert. Mit dem *sphinx-intl* Befehl wird das docs/locale/de Verzeichnis aktualisiert::

source: translate the .po files in ./locale/de/LC_MESSAGES/ and build mo files::
de: Übersetzen der .po Dateien im ./locale/de/LC_MESSAGES/ Verzeichnis und danach die mo Dateien generieren::

source: To build local the docu in German::
de: Generieren der Dokumentation in Deutsch::
